atmosphere/tutorials/ce3/x8bubble_62m/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }

    "(p_rgh|ph_rgh|ph_rgh_hyd)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    "(p_rghFinal|ph_rghFinal|ph_rgh_hydFinal)"
    {
        $p_rgh;
        relTol          0;
    }

    "(U|h|e|k|epsilon|R|theta)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|h|e|k|epsilon|R|theta)Final"
    {
        $U;
        relTol          0;
    }

    // aggiunto
    "pcorr.*"
    {
    solver PCG;
    preconditioner
    {
    preconditioner GAMG;
    tolerance 1e-5;
    relTol 0;
    smoother GaussSeidel;
    nPreSweeps 0;
    nPostSweeps 2;
    nFinestSweeps 2;
    cacheAgglomeration true;
    nCellsInCoarsestLevel 10;
    agglomerator faceAreaPair;
    mergeLevels 1;
    }
    tolerance 1e-5;
    relTol 0;
    maxIter 50;
    }

}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 1;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;

    hydrostaticInitialization yes;
    nHydrostaticCorrectors 500;

    pRefCell  0;
    pRefValue   1e5;
}


// ************************************************************************* //
